## csp_violation_report_service
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                         |
|--------|-----------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.csp_report_error` |
|        | `aws_cloudwatch_metric_alarm.csp_report_error`      |
|        | `aws_wafv2_web_acl.csp_report`                      |
| update | `aws_cloudfront_distribution.csp_reports`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.csp_reports will be updated in-place
  ~ resource "aws_cloudfront_distribution" "csp_reports" {
        id                             = "EV9SBO5TEQZ46"
        tags                           = {
            "CostCentre" = "csp_violation_report_service"
            "Terraform"  = "true"
        }
      + web_acl_id                     = (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_cloudwatch_log_metric_filter.csp_report_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "csp_report_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/csp_violation_report_service"
      + name           = "CSPReportError"
      + pattern        = "?ERROR ?Error"

      + metric_transformation {
          + name      = "CSPReportError"
          + namespace = "CSPReportError"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.csp_report_error will be created
  + resource "aws_cloudwatch_metric_alarm" "csp_report_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:794722365809:internal-sre-alert",
        ]
      + alarm_description                     = "Error logged by the service's lambda function"
      + alarm_name                            = "CSP Report Error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CSPReportError"
      + namespace                             = "CSPReportError"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:794722365809:internal-sre-alert",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_wafv2_web_acl.csp_report will be created
  + resource "aws_wafv2_web_acl" "csp_report" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF for CSP report service"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "csp_report"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "InvalidRequest"
          + priority = 10

          + action {

              + block {
                }
            }

          + statement {

              + not_statement {
                  + statement {
                      + and_statement {
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "post"

                                  + field_to_match {

                                      + method {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "/report"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "InvalidPaths"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "RateLimit"
          + priority = 20

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 500
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "RateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 30

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 40

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "csp_report"
          + sampled_requests_enabled   = false
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.csp_report_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.csp_report_error"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

22 tests, 16 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
